src/EmailWS/branches/generatedSourcesBranch/src/test/resources/messages/min_sample_sendable.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ema="http://decidr.de/webservices/Email" xmlns:dec="http://decidr.de/schema/DecidrTypes" xmlns:dec1="http://decidr.de/schema/DecidrWSTypes">
   <soap:Header/>
   <soap:Body>
      <ema:sendEmail>
         <to>
            <!--1 or more repetitions:-->
            <dec:emailUser>
               <dec:email>rumberrd@studi.informatik.uni-stuttgart.de</dec:email>
            </dec:emailUser>
         </to>
         <cc xsi:nil="true"/>
         <bcc xsi:nil="true"/>
         <!--type: string-->
         <fromName>gero et</fromName>
         <!--type: string-->
         <fromAddress>root@localhost</fromAddress>
         <!--type: string-->
         <subject>quae divum incedo</subject>
         <headers xsi:nil="true"/>
         <!--type: string-->
         <bodyTXT>circum claustra</bodyTXT>
         <!--type: string-->
         <bodyHTML xsi:nil="true"/>
         <attachments xsi:nil="true"/>
      </ema:sendEmail>
   </soap:Body>
</soap:Envelope>